Revit 2027 API
Category.GetLinePatternId Method
Gets the line pattern id associated with this category for the given graphics style type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetLinePatternId(
	GraphicsStyleType graphicsStyleType
)
Public Function GetLinePatternId (
	graphicsStyleType As GraphicsStyleType
) As ElementId
public:
ElementId^ GetLinePatternId(
	GraphicsStyleType graphicsStyleType
)
member GetLinePatternId :
        graphicsStyleType : GraphicsStyleType -> ElementId
Parameters
graphicsStyleType GraphicsStyleType
The type of graphics style.
Return Value
ElementId
Returns the line pattern id associated with this category for the given graphics style type.
Remarks
The line pattern id will be one of the following:
A negative value (representing a built-in line pattern)
The id of a LinePatternElement
InvalidElementId, indicating that this category does not have a stored line pattern id for this graphics style type.
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace